{"sampledata":
  [  
    {
      "id": 1, 
      "name":"libws-commons-util-java", 
      "description":"Common utilities from the Apache Web Services Project This is a small collection of utility classes, that allow high performance XML processing based on SAX",
      "url": "/",
      "url2": "/"

    },  
    {
      "id": 2, 
      "name":"python-pkg-resources", 
      "description":"Package Discovery and Resource Access using pkg_resources The pkg_resources module provides an API for Python libraries to access their resource files, and for extensible applications and frameworks to automatically discover plugins. It also provides runtime support for using C extensions that are inside zipfile-format eggs, support for merging packages that have separately-distributed modules or subpackages, and APIs for managing Python's current working set of active packages.", 
      "url": "/python (>= 2.6)",
      "url2": "/python (<< 2.8)"
    },  
    {
      "id": 3, 
      "name":"tcpd", 
      "description":"Wietse Venema's TCP wrapper utilities Wietse Venema's network logger, also known as TCPD or LOG_TCP..These programs log the client host name of incoming telnet, ftp, rsh, rlogin, finger etc. requests.", 
      "url": "/libc6 (>= 2.4)",
      "url2": "/libwrap0 (>= 7.6-4~)"
    },
    {
      "id": 4, 
      "name":"libbsf-java", 
      "description":"Bean Scripting Framework to support scripting languages in Java Bean Scripting Framework (BSF) is a set of Java classes which provides scripting language support within Java applications, and access to Java objects and methods from scripting languages. BSF allows one to write JSPs in languages other than Java while providing access to the Java class library. In addition, BSF permits any Java application to be implemented in part (or dynamically extended) by a language that is embedded within it. This is achieved by providing an API that permits calling scripting language engines from within Java, as well as an object registry that exposes Java objects to these scripting language engines.", 
      "url": "/libapache-pom-java" 
    },
    {
      "id": 5, 
      "name":"libaspectj-java", 
      "description":"aspect-oriented extension for Java - library AspectJ enables the clean modularization of crosscutting concerns such as: error checking and handling, synchronization, context-sensitive behavior, performance optimizations, monitoring and logging, debugging support, multi-object protocols.", 
      "url": "/" 
    },
    {
      "id": 6, 
      "name":"libslf4j-java", 
      "description":"Simple Logging Facade for Java The Simple Logging Facade for Java (or SLF4J) is intended to serve as a simple facade for various logging APIs allowing to the end-user to plug in the desired implementation at deployment time. SLF4J also allows for a gradual migration path away from Apache Commons Logging (CL)", 
      "url": "/" 
    },
    {
      "id": 7, 
      "name":"libplexus-sec-dispatcher-java", 
      "description":"Plexus Security Dispatcher Component used by Maven The Plexus project provides a full software stack for creating and executing software projects. Based on the Plexus container, the applications can utilise component-oriented programming to build modular, reusable components that can easily be assembled and reused.", 
      "url": "/junit (>= 3.8.2)",
      "url2": "/libplexus-cipher-java",
      "url3": "/libplexus-container-default-java", 
      "url4": "/libplexus-utils-java" 
    },
    {
      "id": 8, 
      "name":"libtext-wrapi18n-perl", 
      "description":"internationalized substitute of Text::Wrap This module is a substitution for Text::Wrap, supporting multibyte characters such as UTF-8, EUC-JP, and GB2312, fullwidth characters such as east Asian characters, combining characters such as diacritical marks and Thai, and languages which don't use whitespaces between words such as Chinese and Japanese.", 
      "url": "/libtext-charwidth-perl" 
    },
    {
      "id": 9, 
      "name":"java-common", 
      "description":"Base of all Java packages This package must be installed in the system if a Java environment is desired. It covers useful information for Java users in", 
      "url": "/" 
    },
    {
      "id": 10, 
      "name":"libantlr-java", 
      "description":"language tool for constructing recognizers, compilers etc (java library) ANTLR, ANother Tool for Language Recognition, (formerly PCCTS) is a language tool that provides a framework for constructing recognizers, compilers, and translators from grammatical descriptions containing C++ or Java actions [You can use PCCTS 1.xx to generate C-based parsers]", 
      "url": "/" 
    },
    {
      "id": 11, 
      "name":"libhttp-date-perl", 
      "description":"module of date conversion routines HTTP::Date provides functions that deal the date formats used by the HTTP protocol (and then some more). Only the first two functions, time2str() and str2time(), are exported by default.", 
      "url": "/perl", 
      "url2": "/libtimedate-perl"
    },
    {
      "id": 12, 
      "name":"libio-stringy-perl", 
      "description":"Perl modules for IO from scalars and arrays The libio-stringy-perl package (which corresponds to the CPAN package", 
      "url": "/perl", 
      "url2": "/"
    },
    {
      "id": 13, 
      "name":"debconf", 
      "description":"Debian configuration management system Debconf is a configuration management system for debian packages. Packages use Debconf to ask questions when they are installed.", 
      "url": "/", 
      "url2": "/"
    },
    {
      "id": 14, 
      "name":"libhttpcore-java", 
      "description":"set of low level HTTP transport components for Java HttpCore is a set of low level HTTP transport components that can be used to build custom client and server side HTTP services with a minimal footprint. HttpCore supports two I/O models: . - blocking I/O model, based on the classic Java I/O; - non-blocking, event driven I/O model based on Java NIO. The blocking I/O model may be more appropriate for data intensive, low latency scenarios, whereas the non-blocking model may be more appropriate for high latency scenarios where raw data throughput is less important than the ability to handle thousands of simultaneous HTTP connections in a resource efficient manner.", 
      "url": "/", 
      "url2": "/"
    }
  ]
}